[pandas DataFrame 数据选取，修改，切片](https://blog.csdn.net/yoonhee/article/details/76168253)

In [1]:
import numpy as np
import pandas as pd

# 初始化一个dataframe

In [2]:
df=pd.DataFrame([['Snow','M',22],
                 ['Tyrion','M',32],
                 ['Sansa','F',18],
                 ['Arya','F',14]],columns=['name','gender','age'])
df

     name gender  age
0    Snow      M   22
1  Tyrion      M   32
2   Sansa      F   18
3    Arya      F   14

# df['column_name']

In [5]:
# df 列名
df.columns

Index(['name', 'gender', 'age'], dtype='object')

In [8]:
# 选取name列
df['name']
# 选取多列
df[['name','age']]

     name  age
0    Snow   22
1  Tyrion   32
2   Sansa   18
3    Arya   14

# df[row_start_index, row_end_index]

In [9]:
df[0:] #第0行及之后的行，相当于df的全部数据，注意冒号是必须的

     name gender  age
0    Snow      M   22
1  Tyrion      M   32
2   Sansa      F   18
3    Arya      F   14

In [10]:
df[:2] # 第2行之前的数据

     name gender  age
0    Snow      M   22
1  Tyrion      M   32

In [11]:
df[0:1] # 第0行

   name gender  age
0  Snow      M   22

In [21]:
df[1:3] #第1到2行(不含第三行)

     name gender  age
1  Tyrion      M   32
2   Sansa      F   18

In [14]:
df[-1:] # 最后一行

   name gender  age
3  Arya      F   14

In [15]:
df[-3:-1] # 倒数第三行到倒数第一行

     name gender  age
1  Tyrion      M   32
2   Sansa      F   18

# loc，在知道列名字的情况下，df.loc[index,column] 选取指定行，列的数据

In [19]:
# df.loc[index,column_name]，选取指定行和列
df.loc[0,'name']

Snow
     name  age
0    Snow   22
1  Tyrion   32
2   Sansa   18

In [23]:
 #选取第0行到第2行，name列和age列的数据, 注意这里的行选取是包含下标的,就是包含第3行
df.loc[0:2,['name','age']]

     name  age
0    Snow   22
1  Tyrion   32
2   Sansa   18

In [26]:
df.loc[[1,3],['name','age']]         #选取指定的第1行和第3行，name和age列的数据

     name  age
1  Tyrion   32
3    Arya   14

In [27]:
df.loc[df['gender']=='M','name']     #选取gender列是M，name列的数据

     name  age
0    Snow   22
1  Tyrion   32

In [28]:
df.loc[df['gender']=='M',['name','age']] #选取gender列是M，name和age列的数据

     name  age
0    Snow   22
1  Tyrion   32